Revit 2024 API
RebarContainerItem.Quantity Property
 Identifies the number of bars in rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int Quantity { get; }
Visual Basic
Public ReadOnly Property Quantity As Integer
	Get
Visual C++
public:
property int Quantity {
	int get ();
}
Remarks
 Quantity is equal to NumberOfBarPositions if IncludeFirstBar and IncludeLastBar are set. If any end bars are excluded, they are not counted in the Quantity.
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace